infra/kaggle/kernel_openfoam_xfid_v16/case_template/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);
boundaryField
{
    inlet { type freestreamVelocity; freestreamValue uniform (1 0 0); value uniform (1 0 0); }
    outlet { type freestreamVelocity; freestreamValue uniform (1 0 0); value uniform (1 0 0); }
    sideMin { type freestreamVelocity; freestreamValue uniform (1 0 0); value uniform (1 0 0); }
    sideMax { type freestreamVelocity; freestreamValue uniform (1 0 0); value uniform (1 0 0); }
    top { type freestreamVelocity; freestreamValue uniform (1 0 0); value uniform (1 0 0); }
    bottom { type translatingWallVelocity; U (1 0 0); value uniform (1 0 0); }
    ".*" { type noSlip; }
}
