infra/kaggle/kernel_openfoam_xfid_v16/case_template/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet { type freestreamPressure; freestreamValue uniform 0; U U; }
    outlet { type freestreamPressure; freestreamValue uniform 0; U U; }
    sideMin { type freestreamPressure; freestreamValue uniform 0; U U; }
    sideMax { type freestreamPressure; freestreamValue uniform 0; U U; }
    top { type freestreamPressure; freestreamValue uniform 0; U U; }
    bottom { type zeroGradient; }
    ".*" { type zeroGradient; }
}
